app/views/recipes/_ingredient.html.erb

                        <%= f.label :food_id, "Food", class:"form-label block mb-2 text-sm font-medium text-gray-900 dark:text-gray-300" %>
                        <%= f.select :food_id, current_user.foods.map{|food| [food.name, food.id]}, required: true, class: "bg-gray-50 border border-gray-300 text-gray-900 text-sm rounded-lg focus:ring-blue-500 focus:border-blue-500 block w-full p-2.5 dark:bg-gray-600 dark:border-gray-500 dark:placeholder-gray-400 dark:text-white" %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]