app/views/recipes/public_recipes.html.erb

SELECT SUM(food.quantity * food.price) FROM "recipe_foods" INNER JOIN "foods" "food" ON "food"."id" = "recipe_foods"."food_id" INNER JOIN "recipes" "recipe" ON "recipe"."id" = "recipe_foods"."recipe_id" WHERE "food"."user_id" = $1 AND "recipe"."user_id" = $2 AND "recipe_foods"."recipe_id" = $3  [["user_id", 2], ["user_id", 2], ["recipe_id", 2]]
---
          </p>
          <% @recipe_foods = RecipeFood.joins(:food, :recipe).where(food: { user: recipe.user_id }, recipe: { user: recipe.user_id }) %>