app/views/recipes/show.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1 LIMIT $2  [["recipe_id", 1], ["LIMIT", 1]]
---
          <tbody class="text-gray-600 text-sm font-light">
            <% @recipe.recipe_foods.each do |recipe| %>